# series

In [1]:
import numpy as np
import pandas as pd


from pandas import Series, DataFrame

In [3]:
obj = Series([3,6,9,12])

obj

0     3
1     6
2     9
3    12
dtype: int64

In [4]:
obj.values

array([ 3,  6,  9, 12], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
ww2_casualities = Series([8700000,4300000,3000000,2100000,400000],index=['USSR','Germany','China','Japan','USA'])

ww2_casualities

USSR       8700000
Germany    4300000
China      3000000
Japan      2100000
USA         400000
dtype: int64

In [7]:
ww2_casualities['USA']

400000

In [9]:
#check which countries has casualities greater than 4 million

ww2_casualities[ww2_casualities>4000000]

USSR       8700000
Germany    4300000
dtype: int64

In [10]:
'USSR' in ww2_casualities

True

In [11]:
ww2_dict = ww2_casualities.to_dict()

ww2_dict

{'USSR': 8700000,
 'Germany': 4300000,
 'China': 3000000,
 'Japan': 2100000,
 'USA': 400000}

In [12]:
ww2_series = Series(ww2_dict)

ww2_series

USSR       8700000
Germany    4300000
China      3000000
Japan      2100000
USA         400000
dtype: int64

In [13]:
countries = ['China','Germany','Japan','USA','USSR','Argentina']

In [14]:
obj2 = Series(ww2_dict,index=countries)
obj2

China        3000000.0
Germany      4300000.0
Japan        2100000.0
USA           400000.0
USSR         8700000.0
Argentina          NaN
dtype: float64

In [15]:
pd.isnull(obj2)

China        False
Germany      False
Japan        False
USA          False
USSR         False
Argentina     True
dtype: bool

In [16]:
pd.notnull(obj2)

China         True
Germany       True
Japan         True
USA           True
USSR          True
Argentina    False
dtype: bool

In [17]:
ww2_series

USSR       8700000
Germany    4300000
China      3000000
Japan      2100000
USA         400000
dtype: int64

In [18]:
obj2

China        3000000.0
Germany      4300000.0
Japan        2100000.0
USA           400000.0
USSR         8700000.0
Argentina          NaN
dtype: float64

In [19]:
ww2_series + obj2

Argentina           NaN
China         6000000.0
Germany       8600000.0
Japan         4200000.0
USA            800000.0
USSR         17400000.0
dtype: float64

In [21]:
obj2.name = 'World war 2 casualities'
obj2

China        3000000.0
Germany      4300000.0
Japan        2100000.0
USA           400000.0
USSR         8700000.0
Argentina          NaN
Name: World war 2 casualities, dtype: float64

In [22]:
obj2.index.name = 'Countries'

In [23]:
obj2

Countries
China        3000000.0
Germany      4300000.0
Japan        2100000.0
USA           400000.0
USSR         8700000.0
Argentina          NaN
Name: World war 2 casualities, dtype: float64

# DataFrames

In [24]:
import numpy as np

import pandas as pd

from pandas import Series,DataFrame

In [25]:
import webbrowser

website = 'http://en.wikipedia.org/wiki/NFL_win-loss_records'
webbrowser.open(website)

True

In [26]:
nfl_frame = pd.read_clipboard()

nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First,NFL,season,Division
1,Green,Bay,Packers,"1,401",782,581,38.000,0.572,1921,NFC,North
2,Dallas,Cowboys,947,538,403,6,0.571,1960.000,NFC,East,None
3,New,England,Patriots,949,529,411,9.000,0.562,1960,AFC,East
4,Chicago,Bears,"1,435",783,610,42,0.560,1920.000,NFC,North,None
5,Baltimore,Ravens,417,233,183,1,0.560,1996.000,AFC,North,None

In [27]:
nfl_frame.columns

Index(['Rank', 'Team', 'GP', 'Won', 'Lost', 'Tied', 'Pct.', 'First', 'NFL',
       'season', 'Division'],
      dtype='object')

In [28]:
nfl_frame.Rank

1        Green
2       Dallas
3          New
4      Chicago
5    Baltimore
Name: Rank, dtype: object

In [29]:
nfl_frame.Team

1        Bay
2    Cowboys
3    England
4      Bears
5     Ravens
Name: Team, dtype: object

In [32]:
nfl_frame['First']

1       0.572
2    1960.000
3       0.562
4    1920.000
5    1996.000
Name: First, dtype: float64

In [35]:
DataFrame(nfl_frame,columns=['Team','First','Won'])

      Team     First    Won
1      Bay     0.572  1,401
2  Cowboys  1960.000    538
3  England     0.562    949
4    Bears  1920.000    783
5   Ravens  1996.000    233

In [38]:
#adding a column that isn't present
DataFrame(nfl_frame,columns=['Team','First','Won','Stadium'])

      Team     First    Won  Stadium
1      Bay     0.572  1,401      NaN
2  Cowboys  1960.000    538      NaN
3  England     0.562    949      NaN
4    Bears  1920.000    783      NaN
5   Ravens  1996.000    233      NaN

In [39]:
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First,NFL,season,Division
1,Green,Bay,Packers,"1,401",782,581,38.000,0.572,1921,NFC,North
2,Dallas,Cowboys,947,538,403,6,0.571,1960.000,NFC,East,None
3,New,England,Patriots,949,529,411,9.000,0.562,1960,AFC,East
4,Chicago,Bears,"1,435",783,610,42,0.560,1920.000,NFC,North,None
5,Baltimore,Ravens,417,233,183,1,0.560,1996.000,AFC,North,None

In [40]:
nfl_frame.head()

,Rank,Team,GP,Won,Lost,Tied,Pct.,First,NFL,season,Division
1,Green,Bay,Packers,"1,401",782,581,38.000,0.572,1921,NFC,North
2,Dallas,Cowboys,947,538,403,6,0.571,1960.000,NFC,East,None
3,New,England,Patriots,949,529,411,9.000,0.562,1960,AFC,East
4,Chicago,Bears,"1,435",783,610,42,0.560,1920.000,NFC,North,None
5,Baltimore,Ravens,417,233,183,1,0.560,1996.000,AFC,North,None

In [41]:
nfl_frame.head(2)

,Rank,Team,GP,Won,Lost,Tied,Pct.,First,NFL,season,Division
1,Green,Bay,Packers,"1,401",782,581,38.000,0.572,1921,NFC,North
2,Dallas,Cowboys,947,538,403,6,0.571,1960.000,NFC,East,None

In [43]:
nfl_frame.tail()

,Rank,Team,GP,Won,Lost,Tied,Pct.,First,NFL,season,Division
1,Green,Bay,Packers,"1,401",782,581,38.000,0.572,1921,NFC,North
2,Dallas,Cowboys,947,538,403,6,0.571,1960.000,NFC,East,None
3,New,England,Patriots,949,529,411,9.000,0.562,1960,AFC,East
4,Chicago,Bears,"1,435",783,610,42,0.560,1920.000,NFC,North,None
5,Baltimore,Ravens,417,233,183,1,0.560,1996.000,AFC,North,None

In [44]:
nfl_frame.tail(1)

        Rank    Team   GP  Won  Lost  Tied  Pct.   First  NFL season Division
5  Baltimore  Ravens  417  233   183     1  0.56  1996.0  AFC  North     None

In [57]:
#finding with name
nfl_frame.loc[3]

Rank             New
Team         England
GP          Patriots
Won              949
Lost             529
Tied             411
Pct.             9.0
First          0.562
NFL             1960
season           AFC
Division        East
Name: 3, dtype: object

In [58]:
#finding with index
nfl_frame.iloc[3]

Rank        Chicago
Team          Bears
GP            1,435
Won             783
Lost            610
Tied             42
Pct.           0.56
First        1920.0
NFL             NFC
season        North
Division       None
Name: 4, dtype: object

In [59]:
nfl_frame['Stadium'] = 'Levi\'s stadium'

In [60]:
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First,NFL,season,Division,Stadium
1,Green,Bay,Packers,"1,401",782,581,38.000,0.572,1921,NFC,North,Levi's stadium
2,Dallas,Cowboys,947,538,403,6,0.571,1960.000,NFC,East,None,Levi's stadium
3,New,England,Patriots,949,529,411,9.000,0.562,1960,AFC,East,Levi's stadium
4,Chicago,Bears,"1,435",783,610,42,0.560,1920.000,NFC,North,None,Levi's stadium
5,Baltimore,Ravens,417,233,183,1,0.560,1996.000,AFC,North,None,Levi's stadium

In [63]:
nfl_frame['Stadium'] = np.arange(5)

In [64]:
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First,NFL,season,Division,Stadium
1,Green,Bay,Packers,"1,401",782,581,38.000,0.572,1921,NFC,North,0
2,Dallas,Cowboys,947,538,403,6,0.571,1960.000,NFC,East,None,1
3,New,England,Patriots,949,529,411,9.000,0.562,1960,AFC,East,2
4,Chicago,Bears,"1,435",783,610,42,0.560,1920.000,NFC,North,None,3
5,Baltimore,Ravens,417,233,183,1,0.560,1996.000,AFC,North,None,4

In [70]:
#adding series in a dataframe

stadiums = Series(['Levi\'s Stadium','AT&T Stadium'],index=[5,1])

In [71]:
stadiums

5    Levi's Stadium
1      AT&T Stadium
dtype: object

In [72]:
nfl_frame['Stadium']=stadiums

In [73]:
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First,NFL,season,Division,Stadium
1,Green,Bay,Packers,"1,401",782,581,38.000,0.572,1921,NFC,North,AT&T Stadium
2,Dallas,Cowboys,947,538,403,6,0.571,1960.000,NFC,East,None,NaN
3,New,England,Patriots,949,529,411,9.000,0.562,1960,AFC,East,NaN
4,Chicago,Bears,"1,435",783,610,42,0.560,1920.000,NFC,North,None,NaN
5,Baltimore,Ravens,417,233,183,1,0.560,1996.000,AFC,North,None,Levi's Stadium

In [75]:
#deleting a column
del nfl_frame['Stadium']

In [76]:
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First,NFL,season,Division
1,Green,Bay,Packers,"1,401",782,581,38.000,0.572,1921,NFC,North
2,Dallas,Cowboys,947,538,403,6,0.571,1960.000,NFC,East,None
3,New,England,Patriots,949,529,411,9.000,0.562,1960,AFC,East
4,Chicago,Bears,"1,435",783,610,42,0.560,1920.000,NFC,North,None
5,Baltimore,Ravens,417,233,183,1,0.560,1996.000,AFC,North,None

In [78]:
#converting dictionary into dataframe
data = {'City':['SF','LA','NYC'],'Population':[837000,3880000,8400000]}

In [79]:
city_frame = DataFrame(data)

In [80]:
city_frame

  City  Population
0   SF      837000
1   LA     3880000
2  NYC     8400000

In [81]:
website = 'http://pandas.pydata.org/pandas-docs/dev/generated/pandas.DataFrame.html'
webbrowser.open(website)

True

# Index Objects

In [83]:
my_ser = Series([1,2,3,4],index = ['A','B','C','D'])
my_ser

A    1
B    2
C    3
D    4
dtype: int64

In [84]:
my_index = my_ser.index

In [85]:
my_index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [86]:
my_index[2]

'C'

In [87]:
my_index[2:]

Index(['C', 'D'], dtype='object')

In [88]:
my_index[0]

'A'

In [89]:
my_index[0] = 'Z'

TypeError: Index does not support mutable operations

# Reindex

In [90]:
from numpy.random import randn

In [91]:
ser1 = Series([1,2,3,4],index = ['A','B','C','D'])
ser1

A    1
B    2
C    3
D    4
dtype: int64

In [94]:
ser2 = ser1.reindex(['A','B','C','D','E','F'])
ser2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [95]:
ser2 = ser1.reindex(['A','B','C','D','E','F','G'],fill_value=0)
ser2

A    1
B    2
C    3
D    4
E    0
F    0
G    0
dtype: int64

In [96]:
ser3 = Series(['USA','Mexico','Canada'],index=[0,5,10])
ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [97]:
ranger=range(15)

In [98]:
ranger

range(0, 15)

In [102]:
ser3.reindex(ranger)

0        USA
1        NaN
2        NaN
3        NaN
4        NaN
5     Mexico
6        NaN
7        NaN
8        NaN
9        NaN
10    Canada
11       NaN
12       NaN
13       NaN
14       NaN
dtype: object

In [103]:
ser3.reindex(ranger,method='ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [110]:
dframe = DataFrame(randn(25).reshape((5,5)),index=['A','B','D','E','F'],columns=['col1','col2','col3','col4','col5'])
dframe

       col1      col2      col3      col4      col5
A -0.430800 -1.098938  0.838272 -1.581581  0.432104
B  1.438496 -0.601437 -0.422552 -1.570468  1.763363
D  0.016181  0.028554  1.858499  1.416740 -1.474064
E  0.257437 -0.517490 -0.589682  1.085308 -0.420468
F  0.436082  1.030388 -0.715161 -0.501599  1.068892

In [111]:
dframe2 = dframe.reindex(['A','B','C','D','E','F'])

In [112]:
dframe2

       col1      col2      col3      col4      col5
A -0.430800 -1.098938  0.838272 -1.581581  0.432104
B  1.438496 -0.601437 -0.422552 -1.570468  1.763363
C       NaN       NaN       NaN       NaN       NaN
D  0.016181  0.028554  1.858499  1.416740 -1.474064
E  0.257437 -0.517490 -0.589682  1.085308 -0.420468
F  0.436082  1.030388 -0.715161 -0.501599  1.068892

In [113]:
new_columns = ['col1','col2','col3','col4','col5','col6']

In [114]:
dframe2.reindex(columns=new_columns)

       col1      col2      col3      col4      col5  col6
A -0.430800 -1.098938  0.838272 -1.581581  0.432104   NaN
B  1.438496 -0.601437 -0.422552 -1.570468  1.763363   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D  0.016181  0.028554  1.858499  1.416740 -1.474064   NaN
E  0.257437 -0.517490 -0.589682  1.085308 -0.420468   NaN
F  0.436082  1.030388 -0.715161 -0.501599  1.068892   NaN

In [121]:
dframe

       col1      col2      col3      col4      col5
A -0.430800 -1.098938  0.838272 -1.581581  0.432104
B  1.438496 -0.601437 -0.422552 -1.570468  1.763363
D  0.016181  0.028554  1.858499  1.416740 -1.474064
E  0.257437 -0.517490 -0.589682  1.085308 -0.420468
F  0.436082  1.030388 -0.715161 -0.501599  1.068892

# Drop Entry

In [123]:
ser1 = Series(np.arange(3),index=['a','b','c'])
ser1

a    0
b    1
c    2
dtype: int32

In [124]:
ser1.drop('b')

a    0
c    2
dtype: int32

In [128]:
dframe1 = DataFrame(np.arange(16).reshape((4,4)),index=['SF','LA','NY','TX'],columns=['pop','size','height','year'])
dframe1

    pop  size  height  year
SF    0     1       2     3
LA    4     5       6     7
NY    8     9      10    11
TX   12    13      14    15

In [129]:
dframe1.drop('LA')

    pop  size  height  year
SF    0     1       2     3
NY    8     9      10    11
TX   12    13      14    15

In [130]:
dframe1

    pop  size  height  year
SF    0     1       2     3
LA    4     5       6     7
NY    8     9      10    11
TX   12    13      14    15

In [132]:
dframe1.drop('year',axis=1)

    pop  size  height
SF    0     1       2
LA    4     5       6
NY    8     9      10
TX   12    13      14

In [134]:
#original dataframe wont be affected
dframe1

    pop  size  height  year
SF    0     1       2     3
LA    4     5       6     7
NY    8     9      10    11
TX   12    13      14    15

# selecting entries

In [136]:
ser1 = Series(np.arange(3),index=['A','B','C'])
ser1 = 2*ser1

ser1

A    0
B    2
C    4
dtype: int32

In [137]:
ser1['B']

2

In [138]:
ser1[1]

2

In [139]:
ser1[0:3]

A    0
B    2
C    4
dtype: int32

In [140]:
ser1[['A','B']]

A    0
B    2
dtype: int32

In [141]:
ser1[ser1>3]

C    4
dtype: int32

In [142]:
ser1[ser1>3] = 10
ser1

A     0
B     2
C    10
dtype: int32

In [143]:
ser1

A     0
B     2
C    10
dtype: int32

In [145]:
dframe = DataFrame(np.arange(25).reshape((5,5)),index = ['NYC','LA','SF','DC','CHI'],columns=['A','B','C','D','E'])

dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [146]:
dframe['B']

NYC     1
LA      6
SF     11
DC     16
CHI    21
Name: B, dtype: int32

In [147]:
dframe[['B','E']]

      B   E
NYC   1   4
LA    6   9
SF   11  14
DC   16  19
CHI  21  24

In [148]:
dframe[dframe['C']>8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [149]:
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [150]:
dframe > 10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
CHI   True   True   True   True   True

In [154]:
dframe.loc['LA']

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int32